<template>
  <div class="app-box" :class="{loading: loading}">
    <div class="list">
      <TreeSelect :dataList="dataList" @onCheck="updateData" :radio="true" />
    </div>
    <div class="chart-box">
      <Chart ref="chart" :opt="chartData" />
      <div class="table-box">
        <div class="button-box">
          <div class="button" v-for="item in tableList" :key="item" @click="listClick(item)">{{item}}</div>
        </div>
        <table class="table" v-if="tableData">
          <tr>
            <th>批号</th>
            <th colspan="4">{{tableTitle}}</th>
          </tr>
          <tr v-for="(item, index) in tableData" :key="index">
            <th v-for="(itemChild, ind) in item" :key="ind">{{itemChild}}</th>
          </tr>
        </table>
        <div v-else class="empty">
          数据未统计！
        </div>
      </div>
    </div>
    <div class="loading-box">
      <svg class="loadsvg" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 100 100" preserveAspectRatio="xMidYMid" style="background: none;">
        <circle cx="50" cy="50" r="31.3416" fill="none" stroke="#8cd0e5" stroke-width="2">
          <animate attributeName="r" calcMode="spline" values="0;40" keyTimes="0;1" dur="1" keySplines="0 0.2 0.8 1" begin="-0.5s" repeatCount="indefinite"></animate>
          <animate attributeName="opacity" calcMode="spline" values="1;0" keyTimes="0;1" dur="1" keySplines="0.2 0 0.8 1" begin="-0.5s" repeatCount="indefinite"></animate>
        </circle>
        <circle cx="50" cy="50" r="10.8383" fill="none" stroke="#376888" stroke-width="2">
          <animate attributeName="r" calcMode="spline" values="0;40" keyTimes="0;1" dur="1" keySplines="0 0.2 0.8 1" begin="0s" repeatCount="indefinite"></animate>
          <animate attributeName="opacity" calcMode="spline" values="1;0" keyTimes="0;1" dur="1" keySplines="0.2 0 0.8 1" begin="0s" repeatCount="indefinite"></animate>
        </circle>
      </svg>
    </div>
  </div>
</template>

<script>
import Chart from 'echarts-middleware'
import TreeSelect from 'treeselect'
import localforage from 'localforage'

let dataSave = {}
const colorList = ['#FFFF00', '#0000FF','#CCFFCC', '#FFCC99','#33CC33', "#CCFFFF", "#66CCCC"]
export default {
  name: 'app',
  components: {
    Chart,
    TreeSelect
  },
  data () {
    return {
      tooltipData: [],
      loading: true,
      dataList: null,
      tableTitle: '',
      serverIP: 'http://192.168.30.110',
      granularity: 10,
      tableList: [],
      tableData: null,
      chartData: {
        "title": {
          "text": "北京悦康药业", 
          "x": "center", 
          "align": "right"
        }, 
        "grid": {
          "bottom": 240,
          "left": 40,
          "right": 40
        }, 
        "toolbox": {
          "feature": {
            "dataZoom": {
              "yAxisIndex": "none"
            }, 
            "dataView": {
              "readOnly": false
            }, 
            "magicType": {
              "show": true,
              "type": [  "line",   "bar",   "stack",   "tiled"]
            }, 
            "restore": {"show": true
            }, 
            "saveAsImage": {"show": true
            }
          }
        },
        "color": colorList,
        "tooltip": {
          "trigger": "axis",
          "axisPointer": {
            "type": "cross", 
            "animation": false, 
            "label": {
              "backgroundColor": "#505765"
            }
          },
          formatter: (obj) => {
            const tooltipData = this.tooltipData
            let showData = ''
            // console.log(this)
            // console.log(obj)
            for(let item in obj) {
              const data = obj[item]
              if (typeof data === 'object') {
                // 下标乘以粒度
                const dataIndex = data.dataIndex * this.granularity
                // console.log(data.seriesIndex)
                const index = Math.ceil((data.seriesIndex + 1) / 6) - 1
                // console.log(dataIndex)
                // console.log(tooltipData)
                if(item % 6 === 0) {
                  showData += `<div style="background: #CCFFFF; color: #333; font-weight: bold;">`
                  showData += `批次: ${tooltipData[index].batch}<br />`
                  showData += `时间: ${tooltipData[index].time[dataIndex]}<br />`
                  showData += `</div>`
                }
                showData += `<span style="color: ${colorList[item % 6]}">${data.seriesId}---${Number(data.value).toFixed(2)}</div><br />`
              }
            }
            return showData;
          }
        }, 
        "legend": {
          "data": [
            "板层入口温度(℃)", 
            "板层出口温度(℃)", 
            "板层控制温度(℃)", 
            "冷阱盘管1温度(℃)",
            "冷阱盘管2温度(℃)",
            "箱体真空(Pa)"
          ],
          "textStyle": {
            "fontSize": 18
          },
          "width": 400,
          "x": "left",
          "bottom": 50
        }, 
        "dataZoom": [
          {
            "filterMode": "empty",
            "show": true,
            "bottom": 180,
            "realtime": false
          }, 
          {
            "type": "inside",
            "filterMode": "empty",
            "realtime": false
          }
        ], 
        "xAxis": [
          {
            "type": "category", 
            "boundaryGap": false, 
            "axisLine": {
              "onZero": false
            }, 
            "data": ["0.0小时","0.0小时","0.0小时","0.1小时","0.1小时","0.1小时","0.1小时","0.1小时","0.1小时","0.1小时","0.2小时","0.2小时","0.2小时","0.2小时","0.2小时","0.3小时","0.3小时","0.3小时","0.3小时","0.3小时","0.3小时","0.3小时","0.4小时","0.4小时","0.4小时","0.4小时","0.4小时","0.5小时","0.5小时","0.5小时","0.5小时","0.5小时","0.5小时","0.6小时","0.6小时","0.6小时","0.6小时","0.6小时","0.6小时","0.7小时","0.7小时","0.7小时","0.7小时","0.7小时","0.7小时","0.8小时","0.8小时","0.8小时","0.8小时","0.8小时","0.8小时","0.8小时","0.9小时","0.9小时","0.9小时","0.9小时","0.9小时","0.9小时","1.0小时","1.0小时","1.0小时","1.0小时","1.0小时","1.1小时","1.1小时","1.1小时","1.1小时","1.1小时","1.1小时","1.1小时","1.2小时","1.2小时","1.2小时","1.2小时","1.2小时","1.3小时","1.3小时","1.3小时","1.3小时","1.3小时","1.3小时","1.4小时","1.4小时","1.4小时","1.4小时","1.4小时","1.4小时","1.4小时","1.5小时","1.5小时","1.5小时","1.5小时","1.5小时","1.6小时","1.6小时","1.6小时","1.6小时","1.6小时","1.6小时","1.6小时","1.7小时","1.7小时","1.7小时","1.7小时","1.7小时","1.8小时","1.8小时","1.8小时","1.8小时","1.8小时","1.8小时","1.9小时","1.9小时","1.9小时","1.9小时","1.9小时","1.9小时","1.9小时","2.0小时","2.0小时","2.0小时","2.0小时","2.0小时","2.0小时","2.1小时","2.1小时","2.1小时","2.1小时","2.1小时","2.1小时","2.2小时","2.2小时","2.2小时","2.2小时","2.2小时","2.3小时","2.3小时","2.3小时","2.3小时","2.3小时","2.3小时","2.4小时","2.4小时","2.4小时","2.4小时","2.4小时","2.4小时","2.5小时","2.5小时","2.5小时","2.5小时","2.5小时","2.5小时","2.5小时","2.6小时","2.6小时","2.6小时","2.6小时","2.6小时","2.6小时","2.7小时","2.7小时","2.7小时","2.7小时","2.7小时","2.8小时","2.8小时","2.8小时","2.8小时","2.8小时","2.8小时","2.9小时","2.9小时","2.9小时","2.9小时","2.9小时","2.9小时","3.0小时","3.0小时","3.0小时","3.0小时","3.0小时","3.0小时","3.0小时","3.1小时","3.1小时","3.1小时","3.1小时","3.1小时","3.1小时","3.2小时","3.2小时","3.2小时","3.2小时","3.2小时","3.3小时","3.3小时","3.3小时","3.3小时","3.3小时","3.3小时","3.4小时","3.4小时","3.4小时","3.4小时","3.4小时","3.4小时","3.5小时","3.5小时","3.5小时","3.5小时","3.5小时","3.5小时","3.5小时","3.6小时","3.6小时","3.6小时","3.6小时","3.6小时","3.6小时","3.7小时","3.7小时","3.7小时","3.7小时","3.7小时","3.8小时","3.8小时","3.8小时","3.8小时","3.8小时","3.8小时","3.9小时","3.9小时","3.9小时","3.9小时","3.9小时","3.9小时","4.0小时","4.0小时","4.0小时","4.0小时","4.0小时","4.0小时","4.0小时","4.1小时","4.1小时","4.1小时","4.1小时","4.1小时","4.2小时","4.2小时","4.2小时","4.2小时","4.2小时","4.2小时","4.3小时","4.3小时","4.3小时","4.3小时","4.3小时","4.3小时","4.3小时","4.4小时","4.4小时","4.4小时","4.4小时","4.4小时","4.5小时","4.5小时","4.5小时","4.5小时","4.5小时","4.5小时","4.5小时","4.6小时","4.6小时","4.6小时","4.6小时","4.6小时","4.7小时","4.7小时","4.7小时","4.7小时","4.7小时","4.7小时","4.8小时","4.8小时","4.8小时","4.8小时","4.8小时","4.8小时","4.8小时","4.9小时","4.9小时","4.9小时","4.9小时","4.9小时","5.0小时","5.0小时","5.0小时","5.0小时","5.0小时","5.0小时","5.0小时","5.1小时","5.1小时","5.1小时","5.1小时","5.1小时","5.2小时","5.2小时","5.2小时","5.2小时","5.2小时","5.2小时","5.3小时","5.3小时","5.3小时","5.3小时","5.3小时","5.3小时","5.3小时","5.4小时","5.4小时","5.4小时","5.4小时","5.4小时","5.5小时","5.5小时","5.5小时","5.5小时","5.5小时","5.5小时","5.5小时","5.6小时","5.6小时","5.6小时","5.6小时","5.6小时","5.7小时","5.7小时","5.7小时","5.7小时","5.7小时","5.7小时","5.8小时","5.8小时","5.8小时","5.8小时","5.8小时","5.8小时","5.8小时","5.9小时","5.9小时","5.9小时","5.9小时","5.9小时","6.0小时","6.0小时","6.0小时","6.0小时","6.0小时","6.0小时","6.0小时","6.1小时","6.1小时","6.1小时","6.1小时","6.1小时","6.2小时","6.2小时","6.2小时","6.2小时","6.2小时","6.2小时","6.3小时","6.3小时","6.3小时","6.3小时","6.3小时","6.3小时","6.3小时","6.4小时","6.4小时","6.4小时","6.4小时","6.4小时","6.5小时","6.5小时","6.5小时","6.5小时","6.5小时","6.5小时","6.5小时","6.6小时","6.6小时","6.6小时","6.6小时","6.6小时","6.7小时","6.7小时","6.7小时","6.7小时","6.7小时","6.7小时","6.8小时","6.8小时","6.8小时","6.8小时","6.8小时","6.8小时","6.8小时","6.9小时","6.9小时","6.9小时","6.9小时","6.9小时","7.0小时","7.0小时","7.0小时","7.0小时","7.0小时","7.0小时","7.0小时","7.1小时","7.1小时","7.1小时","7.1小时","7.1小时","7.2小时","7.2小时","7.2小时","7.2小时","7.2小时","7.2小时","7.3小时","7.3小时","7.3小时","7.3小时","7.3小时","7.3小时","7.3小时","7.4小时","7.4小时","7.4小时","7.4小时","7.4小时","7.5小时","7.5小时","7.5小时","7.5小时","7.5小时","7.5小时","7.5小时","7.6小时","7.6小时","7.6小时","7.6小时","7.6小时","7.7小时","7.7小时","7.7小时","7.7小时","7.7小时","7.7小时","7.8小时","7.8小时","7.8小时","7.8小时","7.8小时","7.8小时","7.8小时","7.9小时","7.9小时","7.9小时","7.9小时","7.9小时","8.0小时","8.0小时","8.0小时","8.0小时","8.0小时","8.0小时","8.1小时","8.1小时","8.1小时","8.1小时","8.1小时","8.1小时","8.2小时","8.2小时","8.2小时","8.2小时","8.2小时","8.2小时","8.3小时","8.3小时","8.3小时","8.3小时","8.3小时","8.3小时","8.3小时","8.4小时","8.4小时","8.4小时","8.4小时","8.4小时","8.4小时","8.5小时","8.5小时","8.5小时","8.5小时","8.5小时","8.6小时","8.6小时","8.6小时","8.6小时","8.6小时","8.6小时","8.7小时","8.7小时","8.7小时","8.7小时","8.7小时","8.7小时","8.8小时","8.8小时","8.8小时","8.8小时","8.8小时","8.8小时","8.8小时","8.9小时","8.9小时","8.9小时","8.9小时","8.9小时","8.9小时","9.0小时","9.0小时","9.0小时","9.0小时","9.0小时","9.1小时","9.1小时","9.1小时","9.1小时","9.1小时","9.1小时","9.2小时","9.2小时","9.2小时","9.2小时","9.2小时","9.2小时","9.3小时","9.3小时","9.3小时","9.3小时","9.3小时","9.3小时","9.3小时","9.4小时","9.4小时","9.4小时","9.4小时","9.4小时","9.4小时","9.5小时","9.5小时","9.5小时","9.5小时","9.5小时","9.6小时","9.6小时","9.6小时","9.6小时","9.6小时","9.6小时","9.7小时","9.7小时","9.7小时","9.7小时","9.7小时","9.7小时","9.8小时","9.8小时","9.8小时","9.8小时","9.8小时","9.8小时","9.8小时","9.9小时","9.9小时","9.9小时","9.9小时","9.9小时","9.9小时","10.0小时","10.0小时","10.0小时","10.0小时","10.0小时","10.1小时","10.1小时","10.1小时","10.1小时","10.1小时","10.1小时","10.2小时","10.2小时","10.2小时","10.2小时","10.2小时","10.2小时","10.3小时","10.3小时","10.3小时","10.3小时","10.3小时","10.3小时","10.3小时","10.4小时","10.4小时","10.4小时","10.4小时","10.4小时","10.4小时","10.5小时","10.5小时","10.5小时","10.5小时","10.5小时","10.6小时","10.6小时","10.6小时","10.6小时","10.6小时","10.6小时","10.7小时","10.7小时","10.7小时","10.7小时","10.7小时","10.7小时","10.8小时","10.8小时","10.8小时","10.8小时","10.8小时","10.8小时","10.8小时","10.9小时","10.9小时","10.9小时","10.9小时","10.9小时","10.9小时","11.0小时","11.0小时","11.0小时","11.0小时","11.0小时","11.1小时","11.1小时","11.1小时","11.1小时","11.1小时","11.1小时","11.2小时","11.2小时","11.2小时","11.2小时","11.2小时","11.2小时","11.3小时","11.3小时","11.3小时","11.3小时","11.3小时","11.3小时","11.3小时","11.4小时","11.4小时","11.4小时","11.4小时","11.4小时","11.4小时","11.5小时","11.5小时","11.5小时","11.5小时","11.5小时","11.6小时","11.6小时","11.6小时","11.6小时","11.6小时","11.6小时","11.7小时","11.7小时","11.7小时","11.7小时","11.7小时","11.7小时","11.8小时","11.8小时","11.8小时","11.8小时","11.8小时","11.8小时","11.8小时","11.9小时","11.9小时","11.9小时","11.9小时","11.9小时","11.9小时","12.0小时","12.0小时","12.0小时","12.0小时","12.0小时","12.1小时","12.1小时","12.1小时","12.1小时","12.1小时","12.1小时","12.2小时","12.2小时","12.2小时","12.2小时","12.2小时","12.2小时","12.3小时","12.3小时","12.3小时","12.3小时","12.3小时","12.3小时","12.3小时","12.4小时","12.4小时","12.4小时","12.4小时","12.4小时","12.4小时","12.5小时","12.5小时","12.5小时","12.5小时","12.5小时","12.6小时","12.6小时","12.6小时","12.6小时","12.6小时","12.6小时","12.7小时","12.7小时","12.7小时","12.7小时","12.7小时","12.7小时","12.8小时","12.8小时","12.8小时","12.8小时","12.8小时","12.8小时","12.8小时","12.9小时","12.9小时","12.9小时","12.9小时","12.9小时","12.9小时","13.0小时","13.0小时","13.0小时","13.0小时","13.0小时","13.1小时","13.1小时","13.1小时","13.1小时","13.1小时","13.1小时","13.2小时","13.2小时","13.2小时","13.2小时","13.2小时","13.2小时","13.3小时","13.3小时","13.3小时","13.3小时","13.3小时","13.3小时","13.3小时","13.4小时","13.4小时","13.4小时","13.4小时","13.4小时","13.4小时","13.5小时","13.5小时","13.5小时","13.5小时","13.5小时","13.6小时","13.6小时","13.6小时","13.6小时","13.6小时","13.6小时","13.7小时","13.7小时","13.7小时","13.7小时","13.7小时","13.7小时","13.8小时","13.8小时","13.8小时","13.8小时","13.8小时","13.8小时","13.8小时","13.9小时","13.9小时","13.9小时","13.9小时","13.9小时","13.9小时","14.0小时","14.0小时","14.0小时","14.0小时","14.0小时","14.1小时","14.1小时","14.1小时","14.1小时","14.1小时","14.1小时","14.2小时","14.2小时","14.2小时","14.2小时","14.2小时","14.2小时","14.3小时","14.3小时","14.3小时","14.3小时","14.3小时","14.3小时","14.3小时","14.4小时","14.4小时","14.4小时","14.4小时","14.4小时","14.4小时","14.5小时","14.5小时","14.5小时","14.5小时","14.5小时","14.6小时","14.6小时","14.6小时","14.6小时","14.6小时","14.6小时","14.7小时","14.7小时","14.7小时","14.7小时","14.7小时","14.7小时","14.8小时","14.8小时","14.8小时","14.8小时","14.8小时","14.8小时","14.8小时","14.9小时","14.9小时","14.9小时","14.9小时","14.9小时","14.9小时","15.0小时","15.0小时","15.0小时","15.0小时","15.0小时","15.1小时","15.1小时","15.1小时","15.1小时","15.1小时","15.1小时","15.2小时","15.2小时","15.2小时","15.2小时","15.2小时","15.2小时","15.3小时","15.3小时","15.3小时","15.3小时","15.3小时","15.3小时","15.3小时","15.4小时","15.4小时","15.4小时","15.4小时","15.4小时","15.4小时","15.5小时","15.5小时","15.5小时","15.5小时","15.5小时","15.6小时","15.6小时","15.6小时","15.6小时","15.6小时","15.6小时","15.7小时","15.7小时","15.7小时","15.7小时","15.7小时","15.7小时","15.8小时","15.8小时","15.8小时","15.8小时","15.8小时","15.8小时","15.8小时","15.9小时","15.9小时","15.9小时","15.9小时","15.9小时","15.9小时","16.0小时","16.0小时","16.0小时","16.0小时","16.0小时","16.1小时","16.1小时","16.1小时","16.1小时","16.1小时","16.1小时","16.1小时","16.2小时","16.2小时","16.2小时","16.2小时","16.2小时","16.3小时","16.3小时","16.3小时","16.3小时","16.3小时","16.3小时","16.4小时","16.4小时","16.4小时","16.4小时","16.4小时","16.4小时","16.4小时","16.5小时","16.5小时","16.5小时","16.5小时","16.5小时","16.6小时","16.6小时","16.6小时","16.6小时","16.6小时","16.6小时","16.6小时","16.7小时","16.7小时","16.7小时","16.7小时","16.7小时","16.8小时","16.8小时","16.8小时","16.8小时","16.8小时","16.8小时","16.9小时","16.9小时","16.9小时","16.9小时","16.9小时","16.9小时","16.9小时","17.0小时","17.0小时","17.0小时","17.0小时","17.0小时","17.1小时","17.1小时","17.1小时","17.1小时","17.1小时","17.1小时","17.1小时","17.2小时","17.2小时","17.2小时","17.2小时","17.2小时","17.3小时","17.3小时","17.3小时","17.3小时","17.3小时","17.3小时","17.4小时","17.4小时","17.4小时","17.4小时","17.4小时","17.4小时","17.4小时","17.5小时","17.5小时","17.5小时","17.5小时","17.5小时","17.6小时","17.6小时","17.6小时","17.6小时","17.6小时","17.6小时","17.6小时","17.7小时","17.7小时","17.7小时","17.7小时","17.7小时","17.8小时","17.8小时","17.8小时","17.8小时","17.8小时","17.8小时","17.9小时","17.9小时","17.9小时","17.9小时","17.9小时","17.9小时","17.9小时","18.0小时","18.0小时","18.0小时","18.0小时","18.0小时","18.1小时","18.1小时","18.1小时","18.1小时","18.1小时","18.1小时","18.1小时","18.2小时","18.2小时","18.2小时","18.2小时","18.2小时","18.3小时","18.3小时","18.3小时","18.3小时","18.3小时","18.3小时","18.4小时","18.4小时","18.4小时","18.4小时","18.4小时","18.4小时","18.4小时","18.5小时","18.5小时","18.5小时","18.5小时","18.5小时","18.6小时","18.6小时","18.6小时","18.6小时","18.6小时","18.6小时","18.6小时","18.7小时","18.7小时","18.7小时","18.7小时","18.7小时","18.8小时","18.8小时","18.8小时","18.8小时","18.8小时","18.8小时","18.9小时","18.9小时","18.9小时","18.9小时","18.9小时","18.9小时","18.9小时","19.0小时","19.0小时","19.0小时","19.0小时","19.0小时","19.1小时","19.1小时","19.1小时","19.1小时","19.1小时","19.1小时","19.1小时","19.2小时","19.2小时","19.2小时","19.2小时","19.2小时","19.3小时","19.3小时","19.3小时","19.3小时","19.3小时","19.3小时","19.4小时","19.4小时","19.4小时","19.4小时","19.4小时","19.4小时","19.4小时","19.5小时","19.5小时","19.5小时","19.5小时","19.5小时","19.6小时","19.6小时","19.6小时","19.6小时","19.6小时","19.6小时","19.6小时","19.7小时","19.7小时","19.7小时","19.7小时","19.7小时","19.8小时","19.8小时","19.8小时","19.8小时","19.8小时","19.8小时","19.9小时","19.9小时","19.9小时","19.9小时","19.9小时","19.9小时","19.9小时","20.0小时","20.0小时","20.0小时","20.0小时","20.0小时","20.1小时","20.1小时","20.1小时","20.1小时","20.1小时","20.1小时","20.1小时","20.2小时","20.2小时","20.2小时","20.2小时","20.2小时","20.3小时","20.3小时","20.3小时","20.3小时","20.3小时","20.3小时","20.4小时","20.4小时","20.4小时","20.4小时","20.4小时","20.4小时","20.4小时","20.5小时","20.5小时","20.5小时","20.5小时","20.5小时","20.6小时","20.6小时","20.6小时","20.6小时","20.6小时","20.6小时","20.6小时","20.7小时","20.7小时","20.7小时","20.7小时","20.7小时","20.8小时","20.8小时","20.8小时","20.8小时","20.8小时","20.8小时","20.9小时","20.9小时","20.9小时","20.9小时","20.9小时","20.9小时","20.9小时","21.0小时","21.0小时","21.0小时","21.0小时","21.0小时","21.1小时","21.1小时","21.1小时","21.1小时","21.1小时","21.1小时","21.1小时","21.2小时","21.2小时","21.2小时","21.2小时","21.2小时","21.3小时","21.3小时","21.3小时","21.3小时","21.3小时","21.3小时","21.4小时","21.4小时","21.4小时","21.4小时","21.4小时","21.4小时","21.4小时","21.5小时","21.5小时","21.5小时","21.5小时","21.5小时","21.6小时","21.6小时","21.6小时","21.6小时","21.6小时","21.6小时","21.6小时","21.7小时","21.7小时","21.7小时","21.7小时","21.7小时","21.8小时","21.8小时","21.8小时","21.8小时","21.8小时","21.8小时","21.9小时","21.9小时","21.9小时","21.9小时","21.9小时","21.9小时","21.9小时","22.0小时","22.0小时","22.0小时","22.0小时","22.0小时","22.1小时","22.1小时","22.1小时","22.1小时","22.1小时","22.1小时","22.1小时","22.2小时","22.2小时","22.2小时","22.2小时","22.2小时","22.3小时","22.3小时","22.3小时","22.3小时","22.3小时","22.3小时","22.4小时","22.4小时","22.4小时","22.4小时","22.4小时","22.4小时","22.4小时","22.5小时","22.5小时","22.5小时","22.5小时","22.5小时","22.6小时","22.6小时","22.6小时","22.6小时","22.6小时","22.6小时","22.6小时","22.7小时","22.7小时","22.7小时","22.7小时","22.7小时","22.8小时","22.8小时","22.8小时","22.8小时","22.8小时","22.8小时","22.9小时","22.9小时","22.9小时","22.9小时","22.9小时","22.9小时","22.9小时","23.0小时","23.0小时","23.0小时","23.0小时","23.0小时","23.1小时","23.1小时","23.1小时","23.1小时","23.1小时","23.1小时","23.1小时","23.2小时","23.2小时","23.2小时","23.2小时","23.2小时","23.3小时","23.3小时","23.3小时","23.3小时","23.3小时","23.3小时","23.4小时","23.4小时","23.4小时","23.4小时","23.4小时","23.4小时","23.4小时","23.5小时","23.5小时","23.5小时","23.5小时","23.5小时","23.6小时","23.6小时","23.6小时","23.6小时","23.6小时","23.6小时","23.6小时","23.7小时","23.7小时","23.7小时","23.7小时","23.7小时","23.8小时","23.8小时","23.8小时","23.8小时","23.8小时","23.8小时","23.9小时","23.9小时","23.9小时","23.9小时","23.9小时","23.9小时","23.9小时","24.0小时","24.0小时","24.0小时","24.0小时","24.0小时","24.1小时","24.1小时","24.1小时","24.1小时","24.1小时","24.1小时","24.1小时","24.2小时","24.2小时","24.2小时","24.2小时","24.2小时","24.3小时","24.3小时","24.3小时","24.3小时","24.3小时","24.3小时","24.4小时","24.4小时","24.4小时","24.4小时","24.4小时","24.4小时","24.4小时","24.5小时","24.5小时","24.5小时","24.5小时","24.5小时","24.6小时","24.6小时","24.6小时","24.6小时","24.6小时","24.6小时","24.6小时","24.7小时","24.7小时","24.7小时","24.7小时","24.7小时","24.8小时","24.8小时","24.8小时","24.8小时","24.8小时","24.8小时","24.9小时","24.9小时","24.9小时","24.9小时","24.9小时","24.9小时","24.9小时","25.0小时","25.0小时","25.0小时","25.0小时","25.0小时","25.1小时","25.1小时","25.1小时","25.1小时","25.1小时","25.1小时","25.1小时","25.2小时","25.2小时","25.2小时","25.2小时","25.2小时","25.3小时","25.3小时","25.3小时","25.3小时","25.3小时","25.3小时","25.4小时","25.4小时","25.4小时","25.4小时","25.4小时","25.4小时","25.4小时","25.5小时","25.5小时","25.5小时","25.5小时","25.5小时","25.6小时","25.6小时","25.6小时","25.6小时","25.6小时","25.6小时","25.6小时","25.7小时","25.7小时","25.7小时","25.7小时","25.7小时","25.8小时","25.8小时","25.8小时","25.8小时","25.8小时","25.8小时","25.9小时","25.9小时","25.9小时","25.9小时","25.9小时","25.9小时","25.9小时","26.0小时","26.0小时","26.0小时","26.0小时","26.0小时","26.1小时","26.1小时","26.1小时","26.1小时","26.1小时","26.1小时","26.1小时","26.2小时","26.2小时","26.2小时","26.2小时","26.2小时","26.3小时","26.3小时","26.3小时","26.3小时","26.3小时","26.3小时","26.4小时","26.4小时","26.4小时","26.4小时","26.4小时","26.4小时","26.4小时","26.5小时","26.5小时","26.5小时","26.5小时","26.5小时","26.6小时","26.6小时","26.6小时","26.6小时","26.6小时","26.6小时","26.6小时","26.7小时","26.7小时","26.7小时","26.7小时","26.7小时","26.8小时","26.8小时","26.8小时","26.8小时","26.8小时","26.8小时","26.9小时","26.9小时","26.9小时","26.9小时","26.9小时","26.9小时","26.9小时","27.0小时","27.0小时","27.0小时","27.0小时","27.0小时","27.1小时","27.1小时","27.1小时","27.1小时","27.1小时","27.1小时","27.1小时","27.2小时","27.2小时","27.2小时","27.2小时","27.2小时","27.3小时","27.3小时","27.3小时","27.3小时","27.3小时","27.3小时","27.4小时","27.4小时","27.4小时","27.4小时","27.4小时","27.4小时","27.4小时","27.5小时","27.5小时","27.5小时","27.5小时","27.5小时","27.6小时","27.6小时","27.6小时","27.6小时","27.6小时","27.6小时","27.6小时","27.7小时","27.7小时","27.7小时","27.7小时","27.7小时","27.8小时","27.8小时","27.8小时","27.8小时","27.8小时","27.8小时","27.9小时","27.9小时","27.9小时","27.9小时","27.9小时","27.9小时","27.9小时","28.0小时","28.0小时","28.0小时","28.0小时","28.0小时","28.1小时","28.1小时","28.1小时","28.1小时","28.1小时","28.1小时","28.1小时","28.2小时","28.2小时","28.2小时","28.2小时","28.2小时","28.3小时","28.3小时","28.3小时","28.3小时","28.3小时","28.3小时","28.4小时","28.4小时","28.4小时","28.4小时","28.4小时","28.4小时","28.4小时","28.5小时","28.5小时","28.5小时","28.5小时","28.5小时","28.6小时","28.6小时","28.6小时","28.6小时","28.6小时","28.6小时","28.6小时","28.7小时","28.7小时","28.7小时","28.7小时","28.7小时","28.8小时","28.8小时","28.8小时","28.8小时","28.8小时","28.8小时","28.9小时","28.9小时","28.9小时","28.9小时","28.9小时","28.9小时","28.9小时","29.0小时","29.0小时","29.0小时","29.0小时","29.0小时","29.1小时","29.1小时","29.1小时","29.1小时","29.1小时","29.1小时","29.1小时","29.2小时","29.2小时","29.2小时","29.2小时","29.2小时","29.3小时","29.3小时","29.3小时","29.3小时","29.3小时","29.3小时","29.4小时","29.4小时","29.4小时","29.4小时","29.4小时","29.4小时","29.4小时","29.5小时","29.5小时","29.5小时","29.5小时","29.5小时","29.6小时","29.6小时","29.6小时","29.6小时","29.6小时","29.6小时","29.6小时","29.7小时","29.7小时","29.7小时","29.7小时","29.7小时","29.8小时","29.8小时","29.8小时","29.8小时","29.8小时","29.8小时","29.9小时","29.9小时","29.9小时","29.9小时","29.9小时","29.9小时","29.9小时","30.0小时","30.0小时","30.0小时","30.0小时","30.0小时","30.1小时","30.1小时","30.1小时","30.1小时","30.1小时","30.1小时","30.1小时","30.2小时","30.2小时","30.2小时","30.2小时","30.2小时","30.3小时","30.3小时","30.3小时","30.3小时","30.3小时","30.3小时","30.4小时","30.4小时","30.4小时","30.4小时","30.4小时","30.4小时","30.4小时","30.5小时","30.5小时","30.5小时","30.5小时","30.5小时","30.6小时","30.6小时","30.6小时","30.6小时","30.6小时","30.6小时","30.6小时","30.7小时","30.7小时","30.7小时","30.7小时","30.7小时","30.8小时","30.8小时","30.8小时","30.8小时","30.8小时","30.8小时","30.9小时","30.9小时","30.9小时","30.9小时","30.9小时","30.9小时","30.9小时","31.0小时","31.0小时","31.0小时","31.0小时","31.0小时","31.1小时","31.1小时","31.1小时","31.1小时","31.1小时","31.1小时","31.1小时","31.2小时","31.2小时","31.2小时","31.2小时","31.2小时","31.3小时","31.3小时","31.3小时","31.3小时","31.3小时","31.3小时","31.4小时","31.4小时","31.4小时","31.4小时","31.4小时","31.4小时","31.4小时","31.5小时","31.5小时","31.5小时","31.5小时","31.5小时","31.6小时","31.6小时","31.6小时","31.6小时","31.6小时","31.6小时","31.6小时","31.7小时","31.7小时","31.7小时","31.7小时","31.7小时","31.8小时","31.8小时","31.8小时","31.8小时","31.8小时","31.8小时","31.9小时","31.9小时","31.9小时","31.9小时","31.9小时","31.9小时","31.9小时","32.0小时","32.0小时","32.0小时","32.0小时","32.0小时","32.0小时","32.1小时","32.1小时","32.1小时","32.1小时","32.1小时","32.1小时","32.2小时","32.2小时","32.2小时","32.2小时","32.2小时","32.3小时","32.3小时","32.3小时","32.3小时","32.3小时","32.3小时","32.4小时","32.4小时","32.4小时","32.4小时","32.4小时","32.4小时","32.5小时","32.5小时","32.5小时","32.5小时","32.5小时","32.5小时","32.5小时","32.6小时","32.6小时","32.6小时","32.6小时","32.6小时","32.6小时","32.7小时","32.7小时","32.7小时","32.7小时","32.7小时","32.8小时","32.8小时","32.8小时","32.8小时","32.8小时","32.8小时","32.9小时","32.9小时","32.9小时","32.9小时","32.9小时","32.9小时","33.0小时","33.0小时","33.0小时","33.0小时","33.0小时","33.0小时","33.0小时","33.1小时","33.1小时","33.1小时","33.1小时","33.1小时","33.1小时","33.2小时","33.2小时","33.2小时","33.2小时","33.2小时","33.3小时","33.3小时","33.3小时","33.3小时","33.3小时","33.3小时","33.4小时","33.4小时","33.4小时","33.4小时","33.4小时","33.4小时","33.5小时","33.5小时","33.5小时","33.5小时","33.5小时","33.5小时","33.5小时","33.6小时","33.6小时","33.6小时","33.6小时","33.6小时","33.6小时","33.7小时","33.7小时","33.7小时","33.7小时","33.7小时","33.8小时","33.8小时","33.8小时","33.8小时","33.8小时","33.8小时","33.9小时","33.9小时","33.9小时","33.9小时","33.9小时","33.9小时","34.0小时","34.0小时","34.0小时","34.0小时","34.0小时","34.0小时","34.0小时","34.1小时","34.1小时","34.1小时","34.1小时","34.1小时","34.1小时","34.2小时","34.2小时","34.2小时","34.2小时","34.2小时","34.3小时","34.3小时","34.3小时","34.3小时","34.3小时","34.3小时","34.4小时","34.4小时","34.4小时","34.4小时","34.4小时","34.4小时","34.5小时","34.5小时","34.5小时","34.5小时","34.5小时","34.5小时","34.5小时","34.6小时","34.6小时","34.6小时","34.6小时","34.6小时","34.6小时","34.7小时","34.7小时","34.7小时","34.7小时","34.7小时","34.8小时","34.8小时","34.8小时","34.8小时","34.8小时","34.8小时","34.9小时","34.9小时","34.9小时","34.9小时","34.9小时","34.9小时","35.0小时","35.0小时","35.0小时","35.0小时","35.0小时","35.0小时","35.0小时","35.1小时","35.1小时","35.1小时","35.1小时","35.1小时","35.1小时","35.2小时","35.2小时","35.2小时","35.2小时","35.2小时","35.3小时","35.3小时","35.3小时","35.3小时","35.3小时","35.3小时","35.4小时","35.4小时","35.4小时","35.4小时","35.4小时","35.4小时","35.5小时","35.5小时","35.5小时","35.5小时","35.5小时","35.5小时","35.5小时","35.6小时","35.6小时","35.6小时","35.6小时","35.6小时","35.6小时","35.7小时","35.7小时","35.7小时","35.7小时","35.7小时","35.8小时","35.8小时","35.8小时","35.8小时","35.8小时","35.8小时","35.9小时","35.9小时","35.9小时","35.9小时","35.9小时","35.9小时","36.0小时","36.0小时","36.0小时","36.0小时","36.0小时","36.0小时","36.0小时","36.1小时","36.1小时","36.1小时","36.1小时","36.1小时","36.1小时","36.2小时","36.2小时","36.2小时","36.2小时","36.2小时","36.3小时","36.3小时","36.3小时","36.3小时","36.3小时","36.3小时","36.4小时","36.4小时","36.4小时","36.4小时","36.4小时","36.4小时","36.5小时","36.5小时","36.5小时","36.5小时","36.5小时","36.5小时","36.5小时","36.6小时","36.6小时","36.6小时","36.6小时","36.6小时","36.6小时","36.7小时","36.7小时","36.7小时","36.7小时","36.7小时","36.8小时","36.8小时","36.8小时","36.8小时","36.8小时","36.8小时","36.9小时","36.9小时","36.9小时","36.9小时","36.9小时","36.9小时","37.0小时","37.0小时","37.0小时","37.0小时","37.0小时","37.0小时","37.0小时","37.1小时","37.1小时","37.1小时","37.1小时","37.1小时","37.1小时","37.2小时","37.2小时","37.2小时","37.2小时","37.2小时","37.3小时","37.3小时","37.3小时","37.3小时","37.3小时","37.3小时","37.4小时","37.4小时","37.4小时","37.4小时","37.4小时","37.4小时","37.5小时","37.5小时","37.5小时","37.5小时","37.5小时","37.5小时","37.5小时","37.6小时","37.6小时","37.6小时","37.6小时","37.6小时","37.6小时"]
          }
        ], 
        "yAxis": [
          {
            "name": "单位值1", 
            "type": "value"
          }
        ], 
        "series": [
        ]
      }
    }
  },
  created () {
    this.get(this.serverIP + '/config.json').then((data) => {
      console.log(data)
    })
  },
  mounted () {
    localforage.getItem('data', (err, value) => {
      if (!err && value) {
        // 从缓存中取出数据
        dataSave = value.dataSave
        this.dataList = value.dataList
        this.tableData = value.tableData
        this.tableList = value.tableList
        this.tableTitle = value.tableTitle
        this.tooltipData = value.tooltipData
        let dataCopy = this.deepClone(this.chartData)
        dataCopy.xAxis = value.dataCopy_xAxis
        dataCopy.series = value.dataCopy_series
        dataCopy.legend.data = value.dataCopy_legend_data
        // 进行粒度过滤
        function gl(array, granularity) {
          const arrayLength = array.length
          let newArray = []
          for(let i = 0; i < arrayLength; i++) {
            if (i % granularity === 0) newArray.push(array[i])
          }
          return newArray
        }
        for (let item in dataCopy.xAxis) {
          dataCopy.xAxis[item].data = gl(dataCopy.xAxis[item].data, this.granularity)
        }
        // console.log(dataCopy.series)
        for (let item in dataCopy.series) {
          dataCopy.series[item].data = gl(dataCopy.series[item].data, this.granularity)
        }
        console.log(dataCopy.xAxis)
        this.$refs.chart.chart.setOption(dataCopy, true)
        this.loading = false
      } else {
        // 如果没有data，但是有dataUrl,那么请求Url获取数据
        this.loadData(this.serverIP + '/odbc.php').then((response) => {
          // 默认选中第一项
          response.data[0].children[0].checked = true
          this.dataList = response.data
          this.updateData({
            checked: true,
            checkedList: response.data
          })
          this.loading = false
        })
      }
    })
  },
  methods: {
    post (url, data, fn) {
      // 发起post请求
      const fetchConfig = {
        method: 'POST',
        headers: {
          'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8'
        },
        credentials: 'credentials',
        cache: 'default',
        body: data
      }
      fetch(url, fetchConfig).then((res) => {
        if (res.ok) { // 请求成功执行回掉
          res.json().then((data) => {
            fn(data)
          }, (err) => {
            fn({})
          })
        } else if (res.status === 401) {
          alert('Oops! You are not authorized.')
        }
      }, (e) => {
        console.error('[POST]请求失败！')
        fn({err: 400, type: e})
      })
    },
    deepClone (obj) {
      if (obj == null || typeof obj !== 'object') {
        return obj
      }
      switch (Object.prototype.toString.call(obj)) {
        case '[object Array]': {
          const result = new Array(obj.length)
          for (let i = 0; i < result.length; ++i) {
            result[i] = this.deepClone(obj[i])
          }
          return result
        }
        // Object.prototype.toString.call(new XxxError) returns '[object Error]'
        case '[object Error]': {
          const result = new obj.constructor(obj.message)
          result.stack = obj.stack // hack...
          return result
        }
        case '[object Date]':
        case '[object RegExp]':
        case '[object Int8Array]':
        case '[object Uint8Array]':
        case '[object Uint8ClampedArray]':
        case '[object Int16Array]':
        case '[object Uint16Array]':
        case '[object Int32Array]':
        case '[object Uint32Array]':
        case '[object Float32Array]':
        case '[object Float64Array]':
        case '[object Map]':
        case '[object Set]':
          return new obj.constructor(obj)
        case '[object Object]': {
          const keys = Object.keys(obj)
          const result = {}
          for (let i = 0; i < keys.length; ++i) {
            const key = keys[i]
            result[key] = this.deepClone(obj[key])
          }
          return result
        }
        default: {
          throw new Error("Unable to copy obj! Its type isn't supported.")
        }
      }
    },
    updateData (e) {
      // 判断是否选中
      const checkList = []
      // 判断是否超过时间
      // if (new Date().getTime() >= 1517673600 * 1000) { return }
      let dataCopy = this.deepClone(this.chartData)
      // 判断选中情况
      e.checkedList.forEach(element => {
        // 判断所有二级目录
        element.children.forEach(childrenElement => {
          // 筛选出选中的项目
          if (childrenElement.checked) {
            checkList.push([element.label, childrenElement.label])
          }
        })
      })
      const dataLenhth = checkList.length
      let dataIndex = 0
      let xAxisMax = 0
      let chartServerData = []
      // console.log(dataCopy)
      // 清空表格列表
      this.tableList = []
      // console.log(checkList)
      checkList.forEach(element => {
        // console.log(element)
        // 判断数据是否不存在
        // console.log(this.dataSave[element[0] + '&&' + element[1]])
        console.log(element[0] + '&&' + element[1])
        if (!dataSave[element[0] + '&&' + element[1]]) {
          console.log('向后端请求数据')
          const dataName = element[1]
          // 加载动画
          this.$refs.chart.chart.showLoading()
          // 如果数据不存在则向后端请求数据
          const sendData = { class: element[0], name: dataName, time: new Date().getTime() / 1000 }
          this.post(this.serverIP + '/odbcData.php', JSON.stringify(sendData), (response) => {
            // console.log(response)
            // 空数据处理
            if (!response.batch) return
            this.tooltipData.push({"batch": response.batch, "time": response.time})
            // console.log(JSON.stringify(this.tooltipData))
            response.batch = null
            response.time = null
            dataSave[element[0] + '&&' + element[1]] = response
            // 增加表格列表
            // console.log(element[0] + '&&' + element[1])
            this.tableList.push(element[0] + '&&' + element[1])
            // 待优化
            chartServerData = chartServerData.concat(response.data)
            // console.log(response)
            const count = parseInt(Number(response.count))
            // console.log(count)
            if (count > xAxisMax) xAxisMax = count
            // 如果数据是最后一个 那么刷新图表
            // console.log(dataIndex)
            if (++dataIndex === dataLenhth) {
              // 生成坐标轴
              const xAxis = Array(xAxisMax).fill(0).map((v, i) => { return (i / 60).toFixed(1) + '小时' })
              // console.log(xAxis)
              dataCopy.xAxis[0].data = xAxis
              dataCopy.series = chartServerData
              // 生成图例
              let legendList = []
              chartServerData.forEach(item => {
                legendList.push(item.name)
              })
              // console.log(dataCopy)
              dataCopy.legend.data = legendList
              this.$refs.chart.chart.setOption(dataCopy, true)
              this.$refs.chart.chart.hideLoading()
              // 保存数据
              const saveData = {
                dataSave: dataSave,
                dataList: this.dataList,
                tableData: this.tableData,
                tableList: this.tableList,
                tableTitle: this.tableTitle,
                tooltipData: this.tooltipData,
                dataCopy_xAxis: dataCopy.xAxis,
                dataCopy_series: chartServerData,
                dataCopy_legend_data: dataCopy.legend.data
              }
              localforage.setItem('data', saveData, (err) => {
                if (err) console.error(err)
              })
            }
          })
        } else {
          // 增加计数器
          dataIndex++
          // console.log(dataIndex, dataLenhth)
          const saveData = dataSave[element[0] + '&&' + element[1]]
          // 增加表格列表
          this.tableList.push(element[0] + '&&' + element[1])
          if (saveData.count > xAxisMax) xAxisMax = parseInt(saveData.count)
          chartServerData = chartServerData.concat(saveData.data)
          if (dataIndex === dataLenhth) {
            // 生成坐标轴
            // console.log(xAxisMax)
            const xAxis = Array(xAxisMax).fill(0).map((v, i) => { return (i / 60).toFixed(1) + '小时' })
            // console.log(xAxis.toString())
            dataCopy.xAxis[0].data = xAxis
            dataCopy.series = chartServerData
            // 生成图例
            let legendList = []
            chartServerData.forEach(item => {
              legendList.push(item.name)
            })
            dataCopy.legend.data = legendList
            // console.log(dataCopy)
            this.$refs.chart.chart.setOption(dataCopy, true)
          }
        }
      })
    },
    loadData (url) {
      return new Promise((resolve, reject) => {
        const obj = new XMLHttpRequest()
        obj.open('GET', url, true)
        obj.onreadystatechange = () => {
          if (obj.readyState !== 4) return
          if (obj.status === 304 || obj.status === 200) {
            const responseText = obj.responseText
            resolve(JSON.parse(responseText))
          }
        }
        obj.send(null)
      })
    },
    listClick (item) {
      const data = item.split('&&')
      // 增加到表格标题
      this.tableTitle = data[1]
      const sendData = { class: data[0], name: data[1] }
      this.post('./content.php', JSON.stringify(sendData), (response) => {
        if (response && JSON.stringify(response) !== '{}') {
          let saveData = [ [" "], ["开始时间"], ["结束时间"], ["总用时"], ["占比"] ]
          const totalTime = new Date(response["总批次"].endTime).getTime() - new Date(response["总批次"].startTime).getTime()
          for (let item in response) {
            const itemData = response[item]
            saveData[0].push(item)
            saveData[1].push(itemData.startTime)
            saveData[2].push(itemData.endTime)
            // 计算时间差
            const timeS = new Date(itemData.endTime).getTime() - new Date(itemData.startTime).getTime()
            saveData[3].push(`${timeS / 1000}秒`)
            saveData[4].push(`${(timeS * 100 / totalTime).toFixed(1)}%`)
          }
          this.tableData = saveData
        } else {
          this.tableData = null
          console.error('没有数据!')
        }
      })
    },
    get (url) {
      return new Promise((resolve, reject) => {
        const headers = {
          'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8'
        }
        fetch(url, headers).then((res) => {
          if (res.ok) {
            res.json().then((data) => {
              resolve(data)
            })
          } else {
            reject(res.status)
          }
        }, (e) => {
          reject(e)
        })
      })
    }
  }
}
</script>

<style scoped>
  html, body {
    margin: 0;
    padding: 0;
    width: 100%;
    height: 100%;
  }
  .app-box {
    width: 100%;
    height: 100%;
    display: flex;
  }
  .list {
    height: 100%;
    width: 12%;
  }
  .chart-box {
    height: 100%;
    width: 88%;
  }
  .loading-box {
    display: none;
    position: absolute;
    left: 0;
    right: 0;
    top: 0;
    bottom: 0;
    margin: auto;
    width: 200px;
    height: 200px;
  }
  .loading .loading-box {
    display: block;
  }
  .loading .list, .loading .chart-box  {
    opacity: 0;
  }
  .table-box {
    position: absolute;
    left: 740px;
    bottom: 10px;
    display: flex;
    width: calc(100% - 782px);
    height: 158px;
    border: 1px solid #ccc
  }
  table {
    background-color: #ccc;
    font-size: 0.8rem;
    width: calc(100% - 200px);
    height: 100%;
  }
  .button-box {
    width: 200px;
    background-color: gainsboro;
    overflow-x: hidden;
    overflow-y: auto;
  }
  .button-box .button {
    height: 30px;
    line-height: 30px;
    background-color: ghostwhite;
    border-bottom: 1px solid #ccc;
    text-align: center;
    padding: 0 5px;
    overflow: hidden;
    font-size: 15px;
    cursor: pointer;
  }
  .button-box .button:hover {
    background-color: cornflowerblue;
    color: white;
  }
  table tr {
    background-color: white;
  }
  .empty {
    width: calc(100% - 200px);
    height: 100%;
    text-align: center;
    line-height: 160px;
    font-size: 2rem;
  }
</style>
